reagent.org
#+TITLE: Reagent Tutorial

This artical is a walkthrough of React.js quickstart tutorial using Reagent.

* Create the testing project
Use the =reagent= template by:

#+BEGIN_SRC sh
  lein new reagent reagent-tutorial
#+END_SRC

Now start figwheel to enable auto compilation of cljs codes and auto
reload js code to our page.

#+BEGIN_SRC sh
  cd reagent-tutorial
  lein figwheel
#+END_SRC

After starting it up, we open the page at [[http://localhost:3449/]],
and see the page containing "Welcome to reagent-tutorial".

* Walk through the tutorial
The react.js quick-start tutorial is
[[https://facebook.github.io/react/docs/tutorial.html]].

We are trying to implement the functions in Reagent.

** Your first component
We build a =CommentBox= component:
#+BEGIN_SRC javascript
  // tutorial1.js
  var CommentBox = React.createClass({
    render: function() {
      return (
        <div className="commentBox">
  	Hello, world! I am a CommentBox.
        </div>
      );
    }
  });
  React.render(
    <CommentBox />,
    document.getElementById('content')
  );
#+END_SRC

Open the =core.cljs= file in =src/cljs/reagent_tutorial= directory.

First we create a corresonding comment box:
#+BEGIN_SRC clojure
  (defn comment-box []
    [:div.commentBox
     "Hello, world! I am a CommentBox."])
#+END_SRC

And modify the render function =mount-root= to:
#+BEGIN_SRC clojure
  (defn mount-root []
      (reagent/render [comment-box] (.getElementById js/document "app")))
#+END_SRC

And You should see that the page's content had chaned to "Hello, world! I am a CommentBox.".

** Composing components
Now we are tring to build the skeletons for =CommentList= and =CommentForm=.
#+BEGIN_SRC javascript
  // tutorial2.js
  var CommentList = React.createClass({
    render: function() {
      return (
        <div className="commentList">
  	Hello, world! I am a CommentList.
        </div>
      );
    }
  });

  var CommentForm = React.createClass({
    render: function() {
      return (
        <div className="commentForm">
  	Hello, world! I am a CommentForm.
        </div>
      );
    }
  });

  // tutorial3.js
  var CommentBox = React.createClass({
    render: function() {
      return (
        <div className="commentBox">
  	<h1>Comments</h1>
  	<CommentList />
  	<CommentForm />
        </div>
      );
    }
  });
#+END_SRC

And change them to corresonding reagent (nothing to explain):

#+BEGIN_SRC clojure
  (defn comment-list []
    [:div.commentList
     "Hello, world! I am a CommentList"])

  (defn comment-form []
    [:div.commentForm
     "Hello, world! I am a CommentForm"])

  (defn comment-box []
    [:div.commentBox
     [:h1 "Comments"]
     [comment-list] 
     [comment-form]])
#+END_SRC

Done, the page should be updated automatically(all hail figwheel).

** Using Props
We can pass information from the parent node to child node, which is
called props in child. So when we want to construct a =Comment=, we
can specify the information it needed: author and content:

#+BEGIN_SRC js
  // tutorial4.js
  var Comment = React.createClass({
    render: function() {
      return (
        <div className="comment">
  	<h2 className="commentAuthor">
  	  {this.props.author}
  	</h2>
  	{this.props.children}
        </div>
      );
    }
  });
#+END_SRC

And we can specify the information(props) via:

#+BEGIN_SRC js
  // tutorial5.js
  var CommentList = React.createClass({
    render: function() {
      return (
        <div className="commentList">
  	<Comment author="Pete Hunt">This is one comment</Comment>
  	<Comment author="Jordan Walke">This is *another* comment</Comment>
        </div>
      );
    }
  });
#+END_SRC

First, note the props are accessed by =this.props=. Second, the
=props= contains a special item called =props.children= which refer to
the wrapped content in the parent.

