reagent.html
<!DOCTYPE html>
<html>
<head>
<title>Reagent Tutorial</title>
<!-- 2015-08-02 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Wang Menglei">
<link rel="Stylesheet" type="text/css" href="assets/css/style.css"/>
</head>
<body>
<div id="preamble" class="status">
<!--<body onload="prettyPrint()">-->
<nav>
    <a href="index.html">Index</a>
    <a href="about.html">About</a>
    <a href="https://lotabout.github.io">Blog</a>
    <a href="sitemap.html">SiteMap</a>
</nav>
</div>
<div id="content">
<h1 class="title">Reagent Tutorial</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Create the testing project</a></li>
<li><a href="#sec-2">Walk through the tutorial</a>
<ul>
<li><a href="#sec-2-1">Your first component</a></li>
<li><a href="#sec-2-2">Composing components</a></li>
<li><a href="#sec-2-3">Using Props</a>
<ul>
<li><a href="#sec-2-3-1">Reagent's Components As Functions</a></li>
<li><a href="#sec-2-3-2">A Little Test of Reagent's Props</a></li>
<li><a href="#sec-2-3-3">A Simple Conclusion of Props in Reagent</a></li>
<li><a href="#sec-2-3-4">A Test Combination of Props and Functions</a></li>
</ul>
</li>
<li><a href="#sec-2-4">Hook up the data model</a></li>
<li><a href="#sec-2-5">Reactive state</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This artical is a walkthrough of React.js quickstart tutorial using Reagent.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Create the testing project</h2>
<div class="outline-text-2" id="text-1">
<p>
Use the <code>reagent</code> template by:
</p>

<div class="org-src-container">

<pre class="src src-sh">lein new reagent reagent-tutorial
</pre>
</div>

<p>
Now start figwheel to enable auto compilation of cljs codes and auto
reload js code to our page.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #8cd0d3;">cd</span> reagent-tutorial
lein figwheel
</pre>
</div>

<p>
After starting it up, we open the page at <a href="http://localhost:3449/">http://localhost:3449/</a>,
and see the page containing "Welcome to reagent-tutorial".
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Walk through the tutorial</h2>
<div class="outline-text-2" id="text-2">
<p>
The react.js quick-start tutorial is
<a href="https://facebook.github.io/react/docs/tutorial.html">https://facebook.github.io/react/docs/tutorial.html</a>.
</p>

<p>
We are trying to implement the functions in Reagent.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Your first component</h3>
<div class="outline-text-3" id="text-2-1">
<p>
We build a <code>CommentBox</code> component:
</p>
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #7f9f7f;">// </span><span style="color: #7f9f7f;">tutorial1.js</span>
<span style="color: #f0dfaf; font-weight: bold;">var</span> <span style="color: #dfaf8f;">CommentBox</span> = React.createClass({
  <span style="color: #8cd0d3;">render</span>: <span style="color: #f0dfaf; font-weight: bold;">function</span>() {
    <span style="color: #f0dfaf; font-weight: bold;">return</span> (
      &lt;div className=<span style="color: #cc9393;">"commentBox"</span>&gt;
        <span style="color: #dfaf8f;">Hello</span>, <span style="color: #dfaf8f;">world</span>! <span style="color: #dfaf8f;">I</span> <span style="color: #dfaf8f;">am</span> <span style="color: #dfaf8f;">a</span> <span style="color: #dfaf8f;">CommentBox</span>.
      &lt;/div&gt;
    );
  }
});
React.render(
  &lt;CommentBox /&gt;,
  document.getElementById(<span style="color: #cc9393;">'content'</span>)
);
</pre>
</div>

<p>
Open the <code>core.cljs</code> file in <code>src/cljs/reagent_tutorial</code> directory.
</p>

<p>
First we create a corresonding comment box:
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #f0dfaf; font-weight: bold;">defn</span> <span style="color: #8cd0d3;">comment-box</span> []
  [<span style="color: #bfebbf;">:div.commentBox</span>
   <span style="color: #cc9393;">"Hello, world! I am a CommentBox."</span>])
</pre>
</div>

<p>
And modify the render function <code>mount-root</code> to:
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #f0dfaf; font-weight: bold;">defn</span> <span style="color: #8cd0d3;">mount-root</span> []
    (<span style="color: #8cd0d3;">reagent</span>/render [comment-box] (<span style="color: #8cd0d3;">.getElementById</span> <span style="color: #8cd0d3;">js</span>/document <span style="color: #cc9393;">"app"</span>)))
</pre>
</div>

<p>
And You should see that the page's content had chaned to "Hello, world! I am a CommentBox.".
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Composing components</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Now we are tring to build the skeletons for <code>CommentList</code> and <code>CommentForm</code>.
</p>
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #7f9f7f;">// </span><span style="color: #7f9f7f;">tutorial2.js</span>
<span style="color: #f0dfaf; font-weight: bold;">var</span> <span style="color: #dfaf8f;">CommentList</span> = React.createClass({
  <span style="color: #8cd0d3;">render</span>: <span style="color: #f0dfaf; font-weight: bold;">function</span>() {
    <span style="color: #f0dfaf; font-weight: bold;">return</span> (
      &lt;div className=<span style="color: #cc9393;">"commentList"</span>&gt;
        <span style="color: #dfaf8f;">Hello</span>, <span style="color: #dfaf8f;">world</span>! <span style="color: #dfaf8f;">I</span> <span style="color: #dfaf8f;">am</span> <span style="color: #dfaf8f;">a</span> <span style="color: #dfaf8f;">CommentList</span>.
      &lt;/div&gt;
    );
  }
});

<span style="color: #f0dfaf; font-weight: bold;">var</span> <span style="color: #dfaf8f;">CommentForm</span> = React.createClass({
  <span style="color: #8cd0d3;">render</span>: <span style="color: #f0dfaf; font-weight: bold;">function</span>() {
    <span style="color: #f0dfaf; font-weight: bold;">return</span> (
      &lt;div className=<span style="color: #cc9393;">"commentForm"</span>&gt;
        <span style="color: #dfaf8f;">Hello</span>, <span style="color: #dfaf8f;">world</span>! <span style="color: #dfaf8f;">I</span> <span style="color: #dfaf8f;">am</span> <span style="color: #dfaf8f;">a</span> <span style="color: #dfaf8f;">CommentForm</span>.
      &lt;/div&gt;
    );
  }
});

<span style="color: #7f9f7f;">// </span><span style="color: #7f9f7f;">tutorial3.js</span>
<span style="color: #f0dfaf; font-weight: bold;">var</span> <span style="color: #dfaf8f;">CommentBox</span> = React.createClass({
  <span style="color: #8cd0d3;">render</span>: <span style="color: #f0dfaf; font-weight: bold;">function</span>() {
    <span style="color: #f0dfaf; font-weight: bold;">return</span> (
      &lt;div className=<span style="color: #cc9393;">"commentBox"</span>&gt;
        &lt;h1&gt;Comments&lt;/h1&gt;
        &lt;CommentList /&gt;
        &lt;CommentForm /&gt;
      &lt;/div&gt;
    );
  }
});
</pre>
</div>

<p>
And change them to corresonding reagent (nothing to explain):
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #f0dfaf; font-weight: bold;">defn</span> <span style="color: #8cd0d3;">comment-list</span> []
  [<span style="color: #bfebbf;">:div.commentList</span>
   <span style="color: #cc9393;">"Hello, world! I am a CommentList"</span>])

(<span style="color: #f0dfaf; font-weight: bold;">defn</span> <span style="color: #8cd0d3;">comment-form</span> []
  [<span style="color: #bfebbf;">:div.commentForm</span>
   <span style="color: #cc9393;">"Hello, world! I am a CommentForm"</span>])

(<span style="color: #f0dfaf; font-weight: bold;">defn</span> <span style="color: #8cd0d3;">comment-box</span> []
  [<span style="color: #bfebbf;">:div.commentBox</span>
   [<span style="color: #bfebbf;">:h1</span> <span style="color: #cc9393;">"Comments"</span>]
   [comment-list] 
   [comment-form]])
</pre>
</div>

<p>
Done, the page should be updated automatically(all hail figwheel).
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Using Props</h3>
<div class="outline-text-3" id="text-2-3">
<p>
We can pass information from the parent node to child node, which is
called props in child. So when we want to construct a <code>Comment</code>, we
can specify the information it needed: author and content:
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #7f9f7f;">// </span><span style="color: #7f9f7f;">tutorial4.js</span>
<span style="color: #f0dfaf; font-weight: bold;">var</span> <span style="color: #dfaf8f;">Comment</span> = React.createClass({
  <span style="color: #8cd0d3;">render</span>: <span style="color: #f0dfaf; font-weight: bold;">function</span>() {
    <span style="color: #f0dfaf; font-weight: bold;">return</span> (
      &lt;div className=<span style="color: #cc9393;">"comment"</span>&gt;
        &lt;h2 className=<span style="color: #cc9393;">"commentAuthor"</span>&gt;
          {<span style="color: #bfebbf;">this</span>.props.author}
        &lt;/h2&gt;
        {<span style="color: #bfebbf;">this</span>.props.children}
      &lt;/div&gt;
    );
  }
});
</pre>
</div>

<p>
And we can specify the information(props) via:
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #7f9f7f;">// </span><span style="color: #7f9f7f;">tutorial5.js</span>
<span style="color: #f0dfaf; font-weight: bold;">var</span> <span style="color: #dfaf8f;">CommentList</span> = React.createClass({
  <span style="color: #8cd0d3;">render</span>: <span style="color: #f0dfaf; font-weight: bold;">function</span>() {
    <span style="color: #f0dfaf; font-weight: bold;">return</span> (
      &lt;div className=<span style="color: #cc9393;">"commentList"</span>&gt;
        &lt;Comment author=<span style="color: #cc9393;">"Pete Hunt"</span>&gt;This is one comment&lt;/Comment&gt;
        &lt;Comment author=<span style="color: #cc9393;">"Jordan Walke"</span>&gt;This is *another* comment&lt;/Comment&gt;
      &lt;/div&gt;
    );
  }
});
</pre>
</div>

<p>
First, note the props are accessed by <code>this.props</code>. Second, the
<code>props</code> contains a special item called <code>props.children</code> which refer to
the wrapped content in the parent.
</p>
</div>
