reagent.org
*** Reagent's Components As Functions
As we had seen, the components in reagent are just like functions in
clojure. So there better be a way to specify the props.

The first one is abstract it like function called.
#+BEGIN_SRC clojure
  (defn comment-item [author & children]
    (into [:div.comment
  	 [:h2.commentAuthor author]]
  	children))

  (defn comment-list []
    [:div.commentList
     [comment-item "Pete Hunt" "This is one comment"]
     [comment-item "Jordan Walke" "This is *another* comment"]])
#+END_SRC

*** A Little Test of Reagent's Props
According to
[[https://reagent-project.github.io/news/any-arguments.html][Reagent
News]], the function conversion described above was introduced recently. 

#+BEGIN_SRC clojure
  (ns example
      (:require [reagent.core :as r :refer [atom]]))

  (defn my-div []
    (let [this (reagent/current-component)]
      (into [:div.custom (reagent/props this)]
  	  (reagent/children this))))

  (defn call-my-div []
    [:div
     [my-div "Some text."]
     [my-div {:style {:font-weight 'bold}}
      [:p "Some other text in bold."]
      [:p "some other text"]]])
#+END_SRC

So now =(reagent/props this)= will be the map ={:style {:font-weight
'bold}}=, and =(reagent/children this)= will be a list of two
components: =[[:p "Some other text in bold."] [:p "some other
text"]]=. That is also the reason that we need to call =into= function
to concate two list.

Also, if you omit the properties in the caller like:
#+BEGIN_SRC clojure
  (defn call-my-div []
    [:div
     [my-div "Some text."]
     [my-div ; removed the properties here
      [:p "Some other text in bold."]
      [:p "some other text"]]])
#+END_SRC

The child simply got nothing(nil) calling to =(reagent/props this)=.

The syntax is a bit tedious, but works, right?

But what is we want to combine the properties and the convenience of
function calls? Now we write a component to check the result:

#+BEGIN_SRC clojure
  (defn comment-item [first-comp & rest-comp]
    (let [this (reagent/current-component)]
      [:div
       [:p "The 'props' propertity: " (str (reagent/props this))]
       [:p "The first component: " (str first-comp)]
       [:p "The rest component: " (str rest-comp)]
       [:p "The children component: " (str (reagent/children this))]]))
#+END_SRC

And by using a map as the first argument:
#+BEGIN_SRC clojure
  (defn comment-list []
    [:div
     [comment-item {:author "Your Name"}
      [:p "first component"]
      [:p "second component"]]])
#+END_SRC

The result is:
#+BEGIN_EXAMPLE
The 'props' propertity: {:author "Your Name"}
The first component: {:author "Your Name"}
The rest component: ([:p "first component"] [:p "second component"])
The children component: [[:p "first component"] [:p "second component"]]
#+END_EXAMPLE

And by using a none-map as the first argument:
#+BEGIN_SRC clojure
  (defn comment-list []
    [:div
     [comment-item ; note the map is deleted here
      [:p "first component"]
      [:p "second component"]]])
#+END_SRC

#+BEGIN_EXAMPLE
The 'props' propertity:
The first component: [:p "first component"]
The rest component: ([:p "second component"])
The children component: [[:p "first component"] [:p "second component"]]
#+END_EXAMPLE

*** A Simple Conclusion of Props in Reagent
1. You can retrieve the properties using =(reagent/props component-reference)=.
2. The =props= refers to the first parameter given by the caller/parent if it
   is a map.
3. The =children= refers to the list of parameters given by the
   caller/parent other than the first parameter if it is a map.

*** A Test Combination of Props and Functions
This can serve as an example when you really need the props, otherwise
use the component as functions would do all the goods. 

#+BEGIN_SRC clojure
  (defn comment-item [props & children]
    [:div.comment
     (into [:p.commentAuthor {:style (:style props)} (:author props)]
  	 children)])

  (defn comment-list []
    [:div.commentList
     [comment-item {:author "Pete Hunt"} "This is one comment"]
     [comment-item {:author "Jordan Walke" :style {:font-weight 'bold}} "This is *another* comment"]])
#+END_SRC

I personally thinks that you will need this only when you cannot
determine the number of properties you will use.

