reagent.html

<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1">Reagent's Components As Functions</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
As we had seen, the components in reagent are just like functions in
clojure. So there better be a way to specify the props.
</p>

<p>
The first one is abstract it like function called.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #f0dfaf; font-weight: bold;">defn</span> <span style="color: #8cd0d3;">comment-item</span> [author &amp; children]
  (into [<span style="color: #bfebbf;">:div.comment</span>
         [<span style="color: #bfebbf;">:h2.commentAuthor</span> author]]
        children))

(<span style="color: #f0dfaf; font-weight: bold;">defn</span> <span style="color: #8cd0d3;">comment-list</span> []
  [<span style="color: #bfebbf;">:div.commentList</span>
   [comment-item <span style="color: #cc9393;">"Pete Hunt"</span> <span style="color: #cc9393;">"This is one comment"</span>]
   [comment-item <span style="color: #cc9393;">"Jordan Walke"</span> <span style="color: #cc9393;">"This is *another* comment"</span>]])
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2">A Little Test of Reagent's Props</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
According to
<a href="https://reagent-project.github.io/news/any-arguments.html">Reagent
News</a>, the function conversion described above was introduced recently. 
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #f0dfaf; font-weight: bold;">ns</span> <span style="color: #8cd0d3;">example</span>
    (<span style="color: #bfebbf;">:require</span> [<span style="color: #8cd0d3;">reagent.core</span> <span style="color: #bfebbf;">:as</span> r <span style="color: #bfebbf;">:refer</span> [atom]]))

(<span style="color: #f0dfaf; font-weight: bold;">defn</span> <span style="color: #8cd0d3;">my-div</span> []
  (<span style="color: #f0dfaf; font-weight: bold;">let</span> [this (<span style="color: #8cd0d3;">reagent</span>/current-component)]
    (into [<span style="color: #bfebbf;">:div.custom</span> (<span style="color: #8cd0d3;">reagent</span>/props this)]
          (<span style="color: #8cd0d3;">reagent</span>/children this))))

(<span style="color: #f0dfaf; font-weight: bold;">defn</span> <span style="color: #8cd0d3;">call-my-div</span> []
  [<span style="color: #bfebbf;">:div</span>
   [my-div <span style="color: #cc9393;">"Some text."</span>]
   [my-div {<span style="color: #bfebbf;">:style</span> {<span style="color: #bfebbf;">:font-weight</span> 'bold}}
    [<span style="color: #bfebbf;">:p</span> <span style="color: #cc9393;">"Some other text in bold."</span>]
    [<span style="color: #bfebbf;">:p</span> <span style="color: #cc9393;">"some other text"</span>]]])
</pre>
</div>

<p>
So now <code>(reagent/props this)</code> will be the map <code>{:style {:font-weight
'bold}}</code>, and <code>(reagent/children this)</code> will be a list of two
components: <code>[[:p "Some other text in bold."] [:p "some other
text"]]</code>. That is also the reason that we need to call <code>into</code> function
to concate two list.
</p>

<p>
Also, if you omit the properties in the caller like:
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #f0dfaf; font-weight: bold;">defn</span> <span style="color: #8cd0d3;">call-my-div</span> []
  [<span style="color: #bfebbf;">:div</span>
   [my-div <span style="color: #cc9393;">"Some text."</span>]
   [my-div <span style="color: #7f9f7f;">; removed the properties here</span>
    [<span style="color: #bfebbf;">:p</span> <span style="color: #cc9393;">"Some other text in bold."</span>]
    [<span style="color: #bfebbf;">:p</span> <span style="color: #cc9393;">"some other text"</span>]]])
</pre>
</div>

<p>
The child simply got nothing(nil) calling to <code>(reagent/props this)</code>.
</p>

<p>
The syntax is a bit tedious, but works, right?
</p>

<p>
But what is we want to combine the properties and the convenience of
function calls? Now we write a component to check the result:
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #f0dfaf; font-weight: bold;">defn</span> <span style="color: #8cd0d3;">comment-item</span> [first-comp &amp; rest-comp]
  (<span style="color: #f0dfaf; font-weight: bold;">let</span> [this (<span style="color: #8cd0d3;">reagent</span>/current-component)]
    [<span style="color: #bfebbf;">:div</span>
     [<span style="color: #bfebbf;">:p</span> <span style="color: #cc9393;">"The 'props' propertity: "</span> (str (<span style="color: #8cd0d3;">reagent</span>/props this))]
     [<span style="color: #bfebbf;">:p</span> <span style="color: #cc9393;">"The first component: "</span> (str first-comp)]
     [<span style="color: #bfebbf;">:p</span> <span style="color: #cc9393;">"The rest component: "</span> (str rest-comp)]
     [<span style="color: #bfebbf;">:p</span> <span style="color: #cc9393;">"The children component: "</span> (str (<span style="color: #8cd0d3;">reagent</span>/children this))]]))
</pre>
</div>

<p>
And by using a map as the first argument:
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #f0dfaf; font-weight: bold;">defn</span> <span style="color: #8cd0d3;">comment-list</span> []
  [<span style="color: #bfebbf;">:div</span>
   [comment-item {<span style="color: #bfebbf;">:author</span> <span style="color: #cc9393;">"Your Name"</span>}
    [<span style="color: #bfebbf;">:p</span> <span style="color: #cc9393;">"first component"</span>]
    [<span style="color: #bfebbf;">:p</span> <span style="color: #cc9393;">"second component"</span>]]])
</pre>
</div>

<p>
The result is:
</p>
<pre class="example">
The 'props' propertity: {:author "Your Name"}
The first component: {:author "Your Name"}
The rest component: ([:p "first component"] [:p "second component"])
The children component: [[:p "first component"] [:p "second component"]]
</pre>

<p>
And by using a none-map as the first argument:
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #f0dfaf; font-weight: bold;">defn</span> <span style="color: #8cd0d3;">comment-list</span> []
  [<span style="color: #bfebbf;">:div</span>
   [comment-item <span style="color: #7f9f7f;">; note the map is deleted here</span>
    [<span style="color: #bfebbf;">:p</span> <span style="color: #cc9393;">"first component"</span>]
    [<span style="color: #bfebbf;">:p</span> <span style="color: #cc9393;">"second component"</span>]]])
</pre>
</div>

<pre class="example">
The 'props' propertity:
The first component: [:p "first component"]
The rest component: ([:p "second component"])
The children component: [[:p "first component"] [:p "second component"]]
</pre>
</div>
</div>

<div id="outline-container-sec-2-3-3" class="outline-4">
<h4 id="sec-2-3-3">A Simple Conclusion of Props in Reagent</h4>
<div class="outline-text-4" id="text-2-3-3">
<ol class="org-ol">
<li>You can retrieve the properties using <code>(reagent/props component-reference)</code>.
</li>
<li>The <code>props</code> refers to the first parameter given by the caller/parent if it
is a map.
</li>
<li>The <code>children</code> refers to the list of parameters given by the
caller/parent other than the first parameter if it is a map.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-3-4" class="outline-4">
<h4 id="sec-2-3-4">A Test Combination of Props and Functions</h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
This can serve as an example when you really need the props, otherwise
use the component as functions would do all the goods. 
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #f0dfaf; font-weight: bold;">defn</span> <span style="color: #8cd0d3;">comment-item</span> [props &amp; children]
  [<span style="color: #bfebbf;">:div.comment</span>
   (into [<span style="color: #bfebbf;">:p.commentAuthor</span> {<span style="color: #bfebbf;">:style</span> (<span style="color: #bfebbf;">:style</span> props)} (<span style="color: #bfebbf;">:author</span> props)]
         children)])

(<span style="color: #f0dfaf; font-weight: bold;">defn</span> <span style="color: #8cd0d3;">comment-list</span> []
  [<span style="color: #bfebbf;">:div.commentList</span>
   [comment-item {<span style="color: #bfebbf;">:author</span> <span style="color: #cc9393;">"Pete Hunt"</span>} <span style="color: #cc9393;">"This is one comment"</span>]
   [comment-item {<span style="color: #bfebbf;">:author</span> <span style="color: #cc9393;">"Jordan Walke"</span> <span style="color: #bfebbf;">:style</span> {<span style="color: #bfebbf;">:font-weight</span> 'bold}} <span style="color: #cc9393;">"This is *another* comment"</span>]])
</pre>
</div>

<p>
I personally thinks that you will need this only when you cannot
determine the number of properties you will use.
</p>
</div>
</div>
</div>
